package kpfu.itis.valisheva.knb_game.start_game.domain

object StoryMessages {
    const val MAIN_STORY_PART_2 =
        "Сегодня тебе выпал шанс погасить свои долги и даже разбогатеть! Победителям будет дано всё, проигравшим же прошлая жизнь покажется райем, если они конечно выживут. \n" +
            "Для начала ты можешь взять в долг от 1 до 10 млн. рублей. под 40%. Они будут начисляться каждый день. Чем дольше ты будешь играть, тем больше ты будешь нам должен. \n"

    const val MAIN_STORY_INSTRUCTIONS_PART_1 = "Ну что ж, к правилам:\n" +
            "У тебя есть 9 карт: по 3 карты \"камень\", \"ножницы\", \"бумага\".\n" +
            "У тебя есть 3 звезды.\n" +
            "Всё просто, выбираешь игрока, играешь с ним в КНБ. Напоминаю : камень побеждает ножницы, ножницы - бумагу, бумага - камень.\n" +
            "После того как сыграл с игроком, карты уничтожаются, если ты победил - забираешь звезду у другого игрока, если проиграл отдаёшь свою звезду."
    const val MAIN_STORY_INSTRUCTION_PART_2 = "Если ты потерял все звёзды - ты проиграл. \n" +
            "Если в конце игры у тебя осталось меньше 3-х звёзд - ты проиграл.\n" +
            "Если в конце игры у тебя остались на руках карты - ты проиграл.\n" +
            "Проигравших ждёт рабство, пока они не отработают свой долг, ха, это значит до смерти. \n" +
            "Помни, за каждую звезду количество взятых в долг денег увеличивается в 10 раз! В итоге ты можешь стать сказочно богатым человеком, хахаха!\n" +
            "Пожалуй я разговорился. Начнём. \n" +
            "\n"

}

